using UnityEngine;
using System.Collections;

public class ENV_Global_Variables : MonoBehaviour {


	//-----------------------------------------------
	//Глобальные переменные относящиеся ко всей игре.
	//-----------------------------------------------
	
	//-----------------------------------------------
	//Переменные, в которых хранятся границы уровней
	//-----------------------------------------------
	
	
	//Границы 1 уровня 
	//public static float Level_1_Left_Border_value  = 0.0f;    //Левая граница по оси X уровня
	//public static float Level_1_Right_Border_value = 0.0f;    //Правая граница по оси X уровня
	//public static float Level_1_Up_Border_value    = 0.0f;	  //Верхняя граница по оси Z уровня
	//public static float Level_1_Down_Border_value  = 0.0f;    //Нижняя граница по оси Z уровня







	//Границы 1 уровня 
	 




	//-----------------------------------------------
	//Переменные, в которых хранятся границы уровней
	//-----------------------------------------------


	//-----------------------------------------------
	//Глобальные переменные относящиеся ко всей игре.
	//-----------------------------------------------




	// Use this for initialization
	void Start () {
	

	}
	
	// Update is called once per frame
	void Update () {
	


	}
}
